namespace Shop.Domain.RoleAgg
{
    public enum Permissions
    {
        دسترسی_به_پنل_ادمین,
        دسترسی_به_پنل_فروشندگی,
        پنل_فروشنده_دسترسی_به_سفارشات,
        پنل_فروشنده_ثبت_محصول_جدید,
        پنل_فروشنده_ویرایش_موجودی_محصولات,
        پنل_ادمین_مدیریت_محصولات,
        پنل_ادمین_مدیریت_سفارشات,
        پنل_ادمین_مدیریت_اسلایدرها,
        پنل_ادمین_مدیریت_بنر_ها,
        پنل_ادمین_مدیریت_کاربران,
        پنل_ادمین_مدیریت_فروشندگان,
        پنل_ادمین_مدیریت_نظرات,
        پنل_ادمین_بخش_پیام_های_پشتیبانی,
        پنل_ادمین_مدیریت_نحوه_ارسال_سفارشات
    }
}
